# Explore & Clean the Data

In [1]:
import glob 
import pandas as pd
import uuid

In [2]:
# Get a list of all CSV files in the specified directory
files = glob.glob("../data/JC-2016*.csv")
# Read all files and concatenate them into a single DataFrame
df_list = list()
# Loop through each file and read it into a DataFrame
for file in files:
    try:
        temp_df = pd.read_csv(file)
        df_list.append(temp_df)
    except pd.errors.EmptyDataError:
        print(f'File {file} is empty and will be skipped.')

# Concatenate all DataFrames into a single DataFrame
citibike_df = pd.concat(df_list, ignore_index=True)

In [3]:
print(f"Number of rows in the DataFrame: {citibike_df.shape[0]}\nNumber of columns in the DataFrame: {citibike_df.shape[1]}")

Number of rows in the DataFrame: 247584
Number of columns in the DataFrame: 15

In [4]:
description_df = pd.DataFrame({
    "attribute": citibike_df.columns,
    "null_values": citibike_df.isnull().sum(),
    "number_of_rows": citibike_df.shape[0],
    "data_type": citibike_df.dtypes,
    "unique_values": citibike_df.nunique(),
    "sample_values": [citibike_df[col].dropna().unique()[:5] for col in citibike_df.columns],
        
})

description_df

,attribute,null_values,number_of_rows,data_type,unique_values,sample_values
Trip Duration,Trip Duration,0,247584,int64,6024,"[362, 200, 202, 248, 903]"
Start Time,Start Time,0,247584,object,244407,"[2016-01-01 00:02:52, 2016-01-01 00:18:22, 201..."
Stop Time,Stop Time,0,247584,object,244137,"[2016-01-01 00:08:54, 2016-01-01 00:21:42, 201..."
Start Station ID,Start Station ID,0,247584,int64,51,"[3186, 3209, 3195, 3211, 3187]"
Start Station Name,Start Station Name,0,247584,object,51,"[Grove St PATH, Brunswick St, Sip Ave, Newark ..."
Start Station Latitude,Start Station Latitude,0,247584,float64,51,"[40.71958611647166, 40.7241765, 40.73074262530..."
Start Station Longitude,Start Station Longitude,0,247584,float64,51,"[-74.04311746358871, -74.0506564, -74.06378388..."
End Station ID,End Station ID,0,247584,int64,102,"[3209, 3213, 3203, 3210, 3214]"
End Station Name,End Station Name,0,247584,object,102,"[Brunswick St, Van Vorst Park, Hamilton Park, ..."
End Station Latitude,End Station Latitude,0,247584,float64,102,"[40.7241765, 40.71848892, 40.727595966, 40.742..."
End Station Longitude,End Station Longitude,0,247584,float64,102,"[-74.0506564, -74.047726625, -74.044247311, -7..."
Bike ID,Bike ID,0,247584,int64,566,"[24647, 24605, 24689, 24693, 24573]"
User Type,User Type,380,247584,object,2,"[Subscriber, Customer]"
Birth Year,Birth Year,18999,247584,float64,64,"[1964.0, 1962.0, 1984.0, 1988.0, 1980.0]"
Gender,Gender,0,247584,int64,3,"[2, 1, 0]"

In [ ]:
# Remove rows where 'User Type' is NaN
citibike_df.dropna(subset=['User Type'], inplace=True)

# Calculate the mean birth year 
mean_birth_year = int(citibike_df['Birth Year'].mean())

# Fill NaN values in 'Birth Year' with the mean birth year
citibike_df['Birth Year'] = citibike_df['Birth Year'].fillna(mean_birth_year)

# Convert 'Trip Duration' from seconds to minutes and round to 2 decimal places
citibike_df['Trip Duration Minutes'] = (citibike_df['Trip Duration'] / 60).round(2)

# Map the 'Gender' values to more descriptive names
citibike_df['Gender Name'] = citibike_df['Gender'].map({
    0: 'Unknown',
    1: 'Male',
    2: 'Female'
})

# Map the user type values to numeric IDs
citibike_df['User Type ID'] = citibike_df['User Type'].map({
    'Subscriber': 1,
    'Customer': 2
})

In [6]:
citibike_df.columns

Index(['Trip Duration', 'Start Time', 'Stop Time', 'Start Station ID',
       'Start Station Name', 'Start Station Latitude',
       'Start Station Longitude', 'End Station ID', 'End Station Name',
       'End Station Latitude', 'End Station Longitude', 'Bike ID', 'User Type',
       'Birth Year', 'Gender', 'Trip Duration Minutes', 'Gender Name',
       'User Type ID'],
      dtype='object')

# Create a DB schema structure - Denormalize

In [7]:
# Create a new column 'Trip Id' starting from 1
citibike_df['Trip Id'] = [str(uuid.uuid4()) for _ in range(len(citibike_df))]

## Extract Trips data

In [8]:
trips_df = citibike_df[['Trip Id', 'Start Time', 'Stop Time', 'Trip Duration Minutes', 
                        'Trip Duration','Start Station ID', 'End Station ID', 
                        'Bike ID', 'User Type ID', 'Birth Year','Gender']]

trips_df = trips_df.rename(columns={'Gender': 'Gender ID', 'Trip Duration': 'Trip Duration Seconds'})

# Standardize column names: lowercase and replace spaces with underscores
trips_df.columns = trips_df.columns.str.lower().str.replace(' ', '_')

# Convert 'Birth Year' to integer type
trips_df['birth_year'] = trips_df['birth_year'].astype(int)

trips_df

,trip_id,start_time,stop_time,trip_duration_minutes,trip_duration_seconds,start_station_id,end_station_id,bike_id,user_type_id,birth_year,gender_id
0,d46c1810-199d-437e-8034-806a559d36ba,2016-01-01 00:02:52,2016-01-01 00:08:54,6.03,362,3186,3209,24647,1,1964,2
1,aecb0eb6-bc3b-4e0e-ac83-ee973b86db62,2016-01-01 00:18:22,2016-01-01 00:21:42,3.33,200,3186,3213,24605,1,1962,1
2,01d03898-956f-41c9-949b-a437edf1849d,2016-01-01 00:18:25,2016-01-01 00:21:47,3.37,202,3186,3213,24689,1,1962,2
3,26cb1959-65b5-4d0b-8026-c7aa6caa7070,2016-01-01 00:23:13,2016-01-01 00:27:21,4.13,248,3209,3203,24693,1,1984,1
4,f1eeeb28-e966-4cec-a2ba-f3233fbfed35,2016-01-01 01:03:20,2016-01-01 01:18:24,15.05,903,3195,3210,24573,2,1979,0
...,...,...,...,...,...,...,...,...,...,...,...
247579,61dc0a69-048a-4b35-ba26-cd26e9125c26,2016-12-31 23:10:16,2016-12-31 23:19:33,9.28,557,3214,3203,24465,1,1981,2
247580,db4db90c-de4d-4813-ab46-2ce71e8b0ce7,2016-12-31 23:29:39,2017-01-01 00:15:29,45.82,2749,3183,3183,24389,2,1979,0
247581,ec376dda-9d61-4eac-a8d4-1b53d4683de2,2016-12-31 23:44:37,2016-12-31 23:47:31,2.88,173,3186,3270,24641,1,1978,1
247582,54ecae1b-4fe9-4449-b3fa-83457db692d7,2016-12-31 23:44:50,2017-01-01 00:25:14,40.40,2424,3214,3214,26219,1,1960,2
247583,2ec039d9-afd5-4f29-a38c-91f15ec86701,2016-12-31 23:44:50,2017-01-01 00:25:10,40.32,2419,3214,3214,24471,1,1956,1

## Extract stations data

In [9]:
start_stations = citibike_df[['Start Station ID', 'Start Station Name', 
                              'Start Station Latitude', 'Start Station Longitude']]
start_stations.columns = ['Station ID', 'Name', 'Latitude', 'Longitude']

end_stations = citibike_df[['End Station ID', 'End Station Name', 
                            'End Station Latitude', 'End Station Longitude']]
end_stations.columns = ['Station ID', 'Name', 'Latitude', 'Longitude']

stations_df = pd.concat([start_stations, end_stations]).drop_duplicates('Station ID')

stations_df.columns = stations_df.columns.str.lower().str.replace(' ', '_')

stations_df.head()

   station_id           name   latitude  longitude
0        3186  Grove St PATH  40.719586 -74.043117
3        3209   Brunswick St  40.724176 -74.050656
4        3195        Sip Ave  40.730743 -74.063784
7        3211     Newark Ave  40.721525 -74.046305
8        3187      Warren St  40.721124 -74.038051

## Extract bikes data

In [10]:
bikes_df = citibike_df[['Bike ID']].drop_duplicates().sort_values(by='Bike ID').reset_index(drop=True)
bikes_df.columns = bikes_df.columns.str.lower().str.replace(' ', '_')
bikes_df.head()

   bike_id
0    14552
1    14632
2    14705
3    14717
4    14786

## Extract gender data

In [11]:
gender_df = citibike_df[['Gender', 'Gender Name']].drop_duplicates().sort_values(by='Gender').reset_index(drop=True)
gender_df = gender_df.rename(columns={'Gender': 'Gender ID'})
# Standardize column names: lowercase and replace spaces with underscores
gender_df.columns = gender_df.columns.str.lower().str.replace(' ', '_')
gender_df.head()

   gender_id gender_name
0          0     Unknown
1          1        Male
2          2      Female

## Extract User data

In [12]:
users_df = citibike_df[['User Type ID', 'User Type']].drop_duplicates().sort_values(by='User Type ID').reset_index(drop=True)
users_df.columns = users_df.columns.str.lower().str.replace(' ', '_')
users_df.head()

   user_type_id   user_type
0             1  Subscriber
1             2    Customer

# ðŸ› ï¸ Storing pandas DataFrames in PostgreSQL: Two Common Approaches

When working with `pandas` DataFrames, there are two primary methods to transfer data into a PostgreSQL database:

---

## ðŸ“ **Approach 1: Export to CSV and Import via pgAdmin (Manual Method)**

Export a DataFrame to a `.csv` file and use **pgAdmin** to import it into a PostgreSQL table.

### âœ… Pros:
- Simple and beginner-friendly.
- Ideal for small datasets or one-time tasks.

### âŒ Cons:
- Manual and not scalable.
- Requires switching between Python and pgAdmin.
- Limited control over data types and schema.

---

## ðŸ”— **Approach 2: Connect to PostgreSQL and Write Tables Using SQLAlchemy (Automated Method)**

Use Python with the `SQLAlchemy` library to connect to PostgreSQL and write DataFrames directly to tables.

### âœ… Pros:
- Automated and scalable.
- Full control over schema and data types.
- Stays within Python, no tool-switching required.

### âŒ Cons:
- Requires setup (e.g., installing libraries, configuring connection).
- Slightly more complex for beginners.

---

## ðŸ“Š **Summary Table**

| **Feature**               | **Approach 1 (CSV + pgAdmin)** | **Approach 2 (SQLAlchemy)** |
|---------------------------|--------------------------------|-----------------------------|
| **Automation**            | Manual                        | Automated                  |
| **Scalability**           | Low                           | High                       |
| **Ease for Beginners**    | High                          | Moderate                   |
| **Control Over Schema**   | Limited                       | Full                       |
| **Tool Usage**            | Python + pgAdmin              | Python Only                |

Choose **Approach 1** for quick, small-scale tasks or if you're new to databases. Use **Approach 2** for larger datasets, automation, or production workflows.

## Approach 1

In [24]:
users_df.to_csv('../data/users.csv', index=False)

## Approach 2

### Make the connection to the PostgreSQL instance

In [27]:
# Import necessary libraries for database connection
from sqlalchemy import create_engine, ForeignKey, text, Table, Column, Integer, String, MetaData, DateTime, Float, ForeignKeyConstraint
from sqlalchemy.schema import CreateTable

username = 'postgres'
password = '697597759'
host = 'localhost'
port = '5432'
database = 'bikerentals'

# SQLAlchemy engine creation
engine = create_engine(f'postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}')

### Create a schema

In [18]:
# Create the schema if it doesn't exist
with engine.begin() as conn:  # begin() will auto-commit
    conn.execute(text("CREATE SCHEMA IF NOT EXISTS bk;"))

### Creating Tables from DataFrames

#### Approach 1: Create Table via `to_sql`, Then Add Primary Key via SQL

This approach uses Pandasâ€™ `to_sql()` method to automatically create the table based on the structure of the DataFrame and insert the data. After the table is created, a separate SQL command is executed to add a primary key constraint on the `"Station ID"` column.

**Pros:**
- Simple and quick for initial data loads.
- Lets Pandas handle the table creation without manually defining columns.
- Suitable for prototyping or ad-hoc work.

**Cons:**
- Adding a primary key afterward can fail if there are duplicate or null values.
- Relies on raw SQL for constraints, which may reduce portability.
- Less explicit schema definition â€” types are inferred from the DataFrame, which can lead to mismatches.

Stations

In [19]:
# Push DataFrame into the new schema
stations_df.to_sql('stations', engine, schema='bk', if_exists='replace', index=False)

# Define the stations table Primary Key
with engine.begin() as conn:
    conn.execute(text('ALTER TABLE bk.stations ADD PRIMARY KEY ("station_id");'))

Genders

In [22]:
gender_df.to_sql('genders', engine, schema='bk', if_exists='replace', index=False)

# Define the Genders table Primary Key
with engine.begin() as conn:
    conn.execute(text('ALTER TABLE bk.genders ADD PRIMARY KEY (gender_id);'))

Bikes

In [23]:
bikes_df.to_sql('bikes', engine, schema='bk', if_exists='replace', index=False)

# Define the Bikes table Primary Key
with engine.begin() as conn:
    conn.execute(text('ALTER TABLE bk.bikes ADD PRIMARY KEY (bike_id);'))

#### Approach 2: Define Table with SQLAlchemy, Then Load Data

This approach explicitly defines the table schema using SQLAlchemy's `Table` and `Column` objects, including primary key constraints. The table is created manually using `CreateTable`, and then `to_sql()` is used to insert data.

**Pros:**
- Full control over schema, data types, and constraints from the start.
- Safer and more robust â€” enforces schema validation before data is loaded.
- Better suited for production environments or complex database structures.

**Cons:**
- More verbose and requires knowledge of SQLAlchemy.
- `to_sql()` with `if_exists='replace'` will drop the table, which also removes the manually created constraints â€” use `append` to preserve schema.
- Slightly more complex setup, especially when syncing schema and data.

When using SQLAlchemy's ForeignKey('bk.stations.station_id'), SQLAlchemy tries to resolve the table bk.stations within its current MetaData() context. But since stations, bikes, and genders were created via to_sql() and not declared in SQLAlchemy, they donâ€™t exist in metadata, and foreign key references to them fail.

In [38]:
metadata = MetaData()

trips_table = Table(
    'trips', metadata,
    Column('trip_id', Integer),
    Column('start_time', DateTime),  # Add other columns as needed
    Column('stop_time', DateTime),
    Column('trip_duration_minutes', Float),
    Column('trip_duration_seconds', Float),
    Column('start_station_id', Integer),
    Column('end_station_id', Integer),
    Column('bike_id', Integer),
    Column('user_type_id', Integer),
    Column('birth_year', Integer),
    Column('gender_id', Integer),
    schema='bk'
)

# Create the table manually
with engine.begin() as conn:
    conn.execute(CreateTable(trips_table, if_not_exists=True))
    
# Insert data into the stations table
trips_df.to_sql(
    'trips', engine,
    schema='bk',
    if_exists='replace',  # Use append in case of wanting to add data without dropping existing data
    index=False
)

with engine.begin() as conn:
    # Define the Primary Key for the trips table
    conn.execute(text('ALTER TABLE bk.trips ADD PRIMARY KEY (trip_id);'))
    # Add foreign key constraints
    conn.execute(
        text('ALTER TABLE bk.trips '
             'ADD CONSTRAINT fk_start_station '
             'FOREIGN KEY (start_station_id) REFERENCES bk.stations(station_id);')
    )
    conn.execute(
        text('ALTER TABLE bk.trips '
             'ADD CONSTRAINT fk_end_station '
             'FOREIGN KEY (end_station_id) REFERENCES bk.stations(station_id);')
    )
    conn.execute(
        text('ALTER TABLE bk.trips '
             'ADD CONSTRAINT fk_bike '
             'FOREIGN KEY (bike_id) REFERENCES bk.bikes(bike_id);')
    )
    conn.execute(
        text('ALTER TABLE bk.trips '
             'ADD CONSTRAINT fk_user_type '
             'FOREIGN KEY (user_type_id) REFERENCES bk.users(user_type_id);')
    )
    conn.execute(
        text('ALTER TABLE bk.trips '
             'ADD CONSTRAINT fk_gender '   
             'FOREIGN KEY (gender_id) REFERENCES bk.genders(gender_id);')
    )

In [40]:
# Verify Table in Schema
with engine.connect() as conn:
    result = conn.execute(text("SELECT * FROM bk.stations;"))
    for row in result:
        print(row)

(3186, 'Grove St PATH', 40.71958611647166, -74.04311746358871)
(3209, 'Brunswick St', 40.7241765, -74.0506564)
(3195, 'Sip Ave', 40.73074262530658, -74.06378388404846)
(3211, 'Newark Ave', 40.72152515, -74.046304543)
(3187, 'Warren St', 40.7211236, -74.03805095)
(3183, 'Exchange Place', 40.7162469, -74.0334588)
(3213, 'Van Vorst Park', 40.71848892, -74.047726625)
(3193, 'Lincoln Park', 40.7246050998869, -74.07840594649315)
(3194, 'McGinley Square', 40.7253399253558, -74.06762212514877)
(3202, 'Newport PATH', 40.7272235, -74.0337589)
(3196, 'Riverview Park', 40.7443187, -74.0439909)
(3214, 'Essex Light Rail', 40.7127742, -74.0364857)
(3207, 'Oakland Ave', 40.7376037, -74.0524783)
(3199, 'Newport Pkwy', 40.7287448, -74.0321082)
(3203, 'Hamilton Park', 40.727595966, -74.044247311)
(3210, 'Pershing Field', 40.742677141, -74.051788633)
(3190, 'Garfield Ave Station', 40.7104670233797, -74.07003879547119)
(3185, 'City Hall', 40.7177325, -74.043845)
(3197, 'North St', 40.752559, -74.044725)
(3192, 'Liberty Light Rail', 40.7112423, -74.0557013)
(3212, 'Christ Hospital', 40.734785818, -74.050443636)
(3225, 'Baldwin at Montgomery', 40.7236589, -74.0641943)
(3215, 'Central Ave', 40.7467299, -74.0492509)
(3206, 'Hilltop', 40.7311689, -74.0575736)
(3184, 'Paulus Hook', 40.7141454, -74.0335519)
(3205, 'JC Medical Center', 40.71653978099194, -74.0496379137039)
(3198, 'Heights Elevator', 40.74871594538023, -74.04044330120087)
(3220, '5 Corners Library', 40.73496102000952, -74.0595030784607)
(3191, 'Union St', 40.7182113, -74.0836394)
(3201, 'Dey St', 40.737711, -74.066921)
(3217, 'Bayside Park', 40.698650544, -74.082079678)
(3188, 'NJCU', 40.7101087, -74.0858489)
(3200, 'MLK Light Rail', 40.7111305, -74.0788855)
(3216, 'Columbia Park', 40.6970299, -74.0969366)
(3189, 'West Side Light Rail', 40.714402, -74.0887723)
(3270, 'Jersey & 6th St', 40.72528910781132, -74.04557168483734)
(3267, 'Morris Canal', 40.7124188237569, -74.03852552175522)
(3272, 'Jersey & 3rd', 40.72333158646436, -74.04595255851744)
(3268, 'Lafayette Park', 40.71346382669195, -74.06285852193832)
(3278, 'Monmouth and 6th', 40.72568548362901, -74.04879033565521)
(3279, 'Dixon Mills', 40.721630142638354, -74.04996782541275)
(3276, 'Marin Light Rail', 40.71458403535893, -74.04281705617905)
(3273, 'Manila & 1st', 40.72165072487999, -74.04288411140442)
(3275, 'Columbus Drive', 40.71835519823214, -74.03891444206238)
(3274, 'Bethune Center', 40.704957516728605, -74.08593088388443)
(3281, 'Leonard Gordon Park', 40.74590996631558, -74.0572714805603)
(3271, 'Danforth Light Rail', 40.69263996618329, -74.08801227807997)
(3269, 'Brunswick & 6th', 40.72601172964625, -74.05038893222809)
(3280, 'Astor Place', 40.71928220070702, -74.07126188278198)
(3426, 'JCBS Depot', 40.70965083364061, -74.06860113143921)
(3277, 'Communipaw & Berry Lane', 40.71435836870427, -74.06661093235016)
(534, 'Water - Whitehall Plaza', 40.70255065, -74.0127234)
(249, 'Harrison St & Hudson St', 40.71870987, -74.0090009)
(225, 'W 14 St & The High Line', 40.74195138, -74.00803013)
(276, 'Duane St & Greenwich St', 40.71748752, -74.0104554)
(403, 'E 2 St & 2 Ave', 40.72502876, -73.99069656)
(295, 'Pike St & E Broadway', 40.71406667, -73.99293911)
(430, 'York St & Jay St', 40.7014851, -73.98656928)
(2008, 'Little West St & 1 Pl', 40.70569254, -74.01677685)
(405, 'Washington St & Gansevoort St', 40.739323, -74.008119)
(147, 'Greenwich St & Warren St', 40.71542197, -74.01121978)
(3178, 'Riverside Dr & W 78 St', 40.78414472, -73.98362492)
(173, 'Broadway & W 49 St', 40.76068327096592, -73.9845272898674)
(252, 'MacDougal St & Washington Sq', 40.73226398, -73.99852205)
(484, 'W 44 St & 5 Ave', 40.75500254, -73.98014437)
(505, '6 Ave & W 33 St', 40.74901271, -73.98848395)
(327, 'Vesey Pl & River Terrace', 40.7153379, -74.01658354)
(363, 'West Thames St', 40.70834698, -74.01713445)
(329, 'Greenwich St & North Moore St', 40.72015227023285, -74.01036500930786)
(457, 'Broadway & W 58 St', 40.76695317, -73.98169333)
(358, 'Christopher St & Greenwich St', 40.73291553, -74.00711384)
(315, 'South St & Gouverneur Ln', 40.70355377, -74.00670227)
(477, 'W 41 St & 8 Ave', 40.75640548, -73.9900262)
(428, 'E 3 St & 1 Ave', 40.72467721, -73.98783413)
(3002, 'South End Ave & Liberty St', 40.711512, -74.015756)
(514, '12 Ave & W 40 St', 40.76087502, -74.00277668)
(390, 'Duffield St & Willoughby St', 40.69221589, -73.9842844)
(501, 'FDR Drive & E 35 St', 40.744219, -73.97121214)
(351, 'Front St & Maiden Ln', 40.70530954, -74.00612572)
(3265, 'E 2 St & 2 Ave E', 40.7245634290432, -73.9894437789917)
(304, 'Broadway & Battery Pl', 40.70463334, -74.01361706)
(284, 'Greenwich Ave & 8 Ave', 40.7390169121, -74.0026376103)
(3314, 'W 95 St & Broadway', 40.7937704, -73.971888)
(498, 'Broadway & W 32 St', 40.74854862, -73.98808416)
(3169, 'Riverside Dr & W 82 St', 40.78720869, -73.98128127)
(380, 'W 4 St & 7 Ave S', 40.73401143, -74.00293877)
(3331, 'Riverside Dr & W 104 St', 40.8013434, -73.9711457439)
(386, 'Centre St & Worth St', 40.71494807, -74.00234482)
(427, 'Bus Slip & State St', 40.701907, -74.013942)
(347, 'Greenwich St & W Houston St', 40.728846, -74.008591)
(359, 'E 47 St & Park Ave', 40.75510267, -73.97498696)
(426, 'West St & Chambers St', 40.71754834, -74.01322069)
(3085, 'Roebling St & N 4 St', 40.71469, -73.95739)
(360, 'William St & Pine St', 40.70717936, -74.00887308)
(328, 'Watts St & Greenwich St', 40.72405549, -74.00965965)
(446, 'W 24 St & 7 Ave', 40.74487634, -73.99529885)
(520, 'W 52 St & 5 Ave', 40.75992262, -73.97648516)
(2004, '6 Ave & Broome St', 40.724399, -74.004704)
(393, 'E 5 St & Avenue C', 40.72299208, -73.97995466)
(401, 'Allen St & Rivington St', 40.72019576, -73.98997825)
(376, 'John St & William St', 40.70862144, -74.00722156)
(224, 'Spruce St & Nassau St', 40.71146364, -74.00552427)